const industries = [
    {
      label: '餐饮',
      value: '餐饮',
      children: ["小吃", "快餐", "淮扬菜", "面包", "甜点", "火锅", "西餐", "咖啡厅", "烧烤", "烤串", "日本菜", "水果", "生鲜", "本帮江浙菜", "面馆", "饮品店", "特色菜", "川菜", "食品滋补", "茶馆", "家常菜", "小龙虾", "烤肉", "私房菜", "粤菜", "鱼鲜", "农家菜", "北京菜", "酒吧", "韩国料理", "自助餐", "东北菜", "湘菜", "新疆菜", "东南亚菜", "素食创意菜", "螺蛳粉", "早茶", "中东菜", "其他餐饮"],
    },
    {
      label: '休闲娱乐',
      value: '休闲娱乐',
      children: ["足疗按摩", "洗浴/汗蒸", "KTV", "酒吧", "密室逃脱", "轰趴馆", "茶馆", "私人影院", "网吧网咖", "DIY手工坊", "采摘/农家乐", "文化艺术", "游乐游艺", "VR", "桌游", "团建拓展", "棋牌室", "桌球馆"],
    },
    {
        label: '结婚',
        value: '结婚',
        children: ["婚纱摄影", "旅拍", "婚宴", "婚礼策划", "婚纱礼服", "西服定制", "婚戒首饰", "彩妆造型", "司仪主持", "婚礼跟拍", "婚车租赁", "婚礼小商品", "个性写真", "婚礼服务", "婚房装修"]
    },
    {
        label: '电影/演出/赛事',
        value: '电影/演出/赛事',
        children: ["电影院", "演出赛事", "演出场馆", "剧场/影院", "音乐厅/礼堂", "艺术中心/文化广场", "赛事展览", "其他电影演出"]
    },
    {
        label: '丽人',
        value: '丽人',
        children: ["美发", "美甲美睫", "美容／SPA", "养发", "瘦身纤体", "瑜伽", "舞蹈", "韩式定妆", "祛痘", "纹身", "化妆品", "产后塑形", "水光补水", "瘦脸", "抗衰老", "双眼皮", "玻尿酸", "美白嫩肤", "除皱瘦脸", "白瓷娃娃", "隆鼻", "超声刀", "冷冻溶脂", "自体脂肪填充", "激光溶脂", "黑脸娃娃", "热玛吉", "开眼角"]
    },
    {
        label: '酒店',
        value: '酒店',
        children: ["五星级/豪华型", "四星级/高档型", "三星级/舒适型", "经济连锁", "情侣酒店", "青年旅社", "客栈"]
    },
    {
        label: '亲子',
        value: '亲子',
        children: ["儿童摄影", "孕妇写真", "满月照", "百天照", "上门拍", "全家福", "儿童乐园", "婴儿游泳", "亲子活动", "亲子会所", "儿童运动馆", "早教中心", "STEM", "幼儿园", "托班/托儿所", "月子会所", "月嫂/育儿嫂", "开奶催乳"]
    },
    {
        label: '游乐',
        value: '游乐',
        children: ["展馆展览", "采摘/农家乐", "温泉", "动植物园", "水上娱乐", "滑雪", "景点", "其他旅游"]
    },
    {
        label: '运动健身',
        value: '运动健身',
        children: ["健身中心", "武术场馆", "游泳馆", "羽毛球馆", "溜冰场", "射箭馆", "篮球场", "桌球馆", "网球场", "攀岩馆", "乒乓球馆", "足球场", "高尔夫场", "保龄球馆", "体育场馆", "壁球馆", "其他运动"]
    },
    {
        label: '购物',
        value: '购物',
        children: ["综合商场", "服饰鞋包", "运动户外", "珠宝饰品", "其他购物"]
    },
    {
        label: '家装',
        value: '家装',
        children: ["装修公司", "装修美图", "装修资讯", "全屋定制", "家具定制", "橱柜", "地板", "瓷砖石材", "厨卫洁具", "灯饰照明", "油漆涂料", "集成吊顶", "成品家具", "床品家纺", "窗帘", "家饰餐厨", "智能家居", "家用电器", "建材卖场", "家居卖场", "灯饰卖场"]
    },
    {
        label: '学习培训',
        value: '学习培训',
        children:  ["外语", "英语", "日语", "韩语", "法语", "德语", "留学", "美术", "音乐", "书法", "舞蹈", "主持表演", "国学", "驾校", "IT", "会计", "厨师", "学历提升", "自习室", "升学辅导", "学科辅导", "STEM"]
    },
    {
        label: '生活服务',
        value: '生活服务',
        children: ["快照冲印", "文印图文", "搬家运输", "生活配送", "家政服务", "洗涤护理", "生活缴费", "社区服务", "成人用品", "家电数码维修", "居家维修", "回收", "周边设施", "通信营业厅", "售票点", "银行", "交通", "房屋地产", "政府机构", "丧葬", "商业服务", "律师服务", "财务服务", "金融", "文化传媒"]
    },
    {
        label: '医疗健康',
        value: '医疗健康',
        children: ["口腔齿科", "体检中心", "医院", "药店", "中医", "宠物医院", "整形", "妇幼医院", "其他医疗"]
    },
    {
        label: '汽车',
        value: '汽车',
        children: ["美容洗车", "维修保养", "摩托车", "加油站", "停车场", "汽车租赁", "4S店／汽车销售", "配件／车饰", "交警队", "汽车保险", "年检站"]
    },
    {
        label: '宠物',
        value: '宠物',
        children:  ["宠物店", "宠物医院"]
    },
];


for (const indus of industries) {
    for (let i = 0; i < indus.children.length; i++) {
        indus.children[i] = {
            label: indus.children[i],
            value: indus.children[i],
        }
    }
}

export default industries;